{
    "about":{
      "header":"About",
      "content":[
        {
          "facility":"Welcome to my page!",
          "paragraphs":[
            "I started writing code in 2015, while still doing my degree in Business Administration in Helsinki Business College. I started bymodifying web page templates and I just got fascinated about design.",
            "My interest in digital media took me into Haaga-Helia to study Business Information Technology. Although I started, lovingdesign and aesthetics, the more code I wrote, the more addicted I got to the problem-solving aspect of it. I started Haaga-Helia, wanting to be a web designer, and ended it wanting to be a full stack developer.",
            "Now that I have my first half a year of industry experience under my belt, I would love to master my skills as a full stackdeveloper, to move towards new challenges in cloud services or in data analytics."
          ]
        }
      ]
     },
     "projects":{
      "header":"Projects",
      "content":[
        {
          "name":"Co2pop",
          "image": "http://storage.googleapis.com/www.elarsaks.com/img/co2pop.png",
          "role":"Project owner",
          "time":"10/2019 & 07/2020",
          "technologies": "React, Redux, Node JS, Express, PostgreSQL, Docker, Linux, Google Cloud",
          "description":[
            "When applying for jobs in 2019, I built a fullstack JS application that fetches CO2 and population data from World Bank API, stores it into the PostgreSQL database and then displays it to the users when requested.",
            "In 2020, I containerized the application into Docker containers and hosted on Google Compute Engine."
          ],
          "links": [
            {
              "text": "Client: ",
              "link": "​http://35.228.98.200:8080/"
            },
            {
              "text": "API: ",
              "link": "​http://35.228.98.200:3001/"
            },
            {
              "text": "Source code: ",
              "link": "​http://github.com/elarsaks/co2pop"
            }
          ]
        },
        {
          "name":"LauttaSaarenSiivous",
          "image": "http://storage.googleapis.com/www.elarsaks.com/img/lauttasaarensiivous.png",
          "role":"Software Developer",
          "time":"10/2017 - 11/2017",
          "technologies": "Html, CSS, JavaScript, Java (Spring boot), AWS (S3, EC2)",
          "description":[
            "I commited a total overkill, by hardcoding a full stack website for a client, who just needed a static page.",
            "At first, I hosted the front end in AWS S3 bucket and backend in AWS EC2, connecting them overhttp. After realizing the unnecessary financial costs, I removed the backend."
          ],
          "links": [
            {
              "text": "Client: ",
              "link": "http://​www.lauttasaarensiivous.fi"
            }
          ]
        },
        {
          "name":"Murupuru",
          "image": "http://storage.googleapis.com/www.elarsaks.com/img/murupuru.png",
          "role":"Project owner",
          "time":"01/2017",
          "technologies": "Html, CSS, JavaScript, Java (Spring boot), AWS (S3, EC2)",
          "description":[
            "As a young and overly ambitious student, I started a company and built a website with a goal to start building and selling web pages for SME-s.",
            "Unfortunately my skills were not even close to where they should be for a such an undertaking."
          ],
          "links": [
            {
              "text": "Client: ",
              "link": "http://www.murupuru.com"
            }
          ]
        },
        {
          "name":"Angular, React, Vue",
          "image": "http://storage.googleapis.com/www.elarsaks.com/img/angular.png",
          "role":"Project owner",
          "time":"01/2019",
          "technologies": "Angular, React, Vue",
          "description":[
            "I wrote my thesis on differences between JavaScript frameworks.",
            "In order to gather data on their performance, I built a simple applications in each one of them.",
            "Applications creates and adds certain amount of rows, with dummy data, according to what button is pressed.",
            "I used the applications to measure the time it takes for each framework to perform a certain function."
          ],
          "links": [
            {
              "text": "Angular: ",
              "link": "http://thesis-angular.s3-website.eu-north-1.amazonaws.com/"
            },
            {
              "text": "React: ",
              "link": "http://thesis-react.s3-website.eu-north-1.amazonaws.com/"
            },
            {
              "text": "Vue: ",
              "link": "http://thesis-vue.s3-website.eu-north-1.amazonaws.com/"
            }
          ]
        }
      ]
    },
     "experience":{
      "header":"Experience",
      "content":[
        {
          "facility":"MuruPuru OY",
          "position":"Owner / Freelance Web Developer",
          "date":"01/2017 – Present",
          "paragraphs":[
            "Created a company and its online presence ​www.murupuru.com​ with a goal to start selling web pages. In reality, this companyended up being a channel for me to sell my time on construction. Currently I am renting myself out as a low level manager,organizing day to day work of a 9 man scaffolding team."
          ]
        },
        {
          "facility":"Edita Publishing",
          "position":"Software Developer Trainee",
          "date":"01/2020 – 06/2020",
          "list":[
            "Worked as a member of an agile development team, participated in daily-, sprint- and monthly meetings.",
            "Built user interfaces and REST API-s, based on senior team members specifications.",
            "Technical tools used daily: JavaScript (Vue, Node), PostgreSQL, Docker, Linux, Github, Slack, Jira and etc."
          ]
        }
      ]
    },
    "education":{
        "header":"Education",
        "content":[
          {
            "facility":"Haaga-Helia",
            "position":"Bachelor’s in Business Information Technology",
            "date":"08/2015 – 01/2019",
            "paragraphs":[
              "Studied Business Information Technology, with a focus on software development. "
            ],
            "list":[
              "Multidisciplinary Software Project (React, Node JS, PostgreSQL)",
              "Software Development Methods",
              "Data Management and Databases (SQL and Database design)",
              "Mobile Programming (PhoneGap)",
              "Server Programming (Java Spring)",
              "Front End Development (Html, CSS, JavaScript)",
              "Programming (Java)",
              "Software Project (Angular JS, Bootstrap)",
              "Python programming"
            ]
          },
          {
            "facility":"Hang Seng Management College",
            "position":"Exchange student",
            "date":"01/​2018 – 06/2018",
            "paragraphs":[
              "Spent half a year as an exchange student in Hong Kong, China."
            ],
            "list":[
              "System Analysis and Design",
              "SQLite and Database Design Data Analytics (SAS)",
              "Digital Marketing"
            ]
          },
          {
            "facility":"Helsinki Business College",
            "position":"Associate Degree in Business Administration",
            "date":"08/​2013 – 06/2015",
            "paragraphs":[
              "Learned the fundamentals of International Trade, Marketing Communication Planning and Implementation, BusinessOperations and Customer Relationship Management. Was awarded European Business Baccalaureate Diploma on graduation."
            ]
          }
        ]
      },
      "volunteering":{
        "header":"volunteering",
        "content":[
          {
            "facility":"Slush",
            "position":"Customer Service",
            "date":"2017",
            "paragraphs": [
              "Slush is the world's leading startup and tech event. Slush facilitates meetings between the founders of startups and investors such as venture capitalists, accomplished with events such as matchmaking and pitching competitions."
            ],
            "list":[
              "Volunteered as a custmoer service staff in during the event."
            ]
          },
          {
            "facility":"European Innovation Academy",
            "position":"COO Assistant",
            "date":"06/2014 and 06/2015",
            "paragraphs":[
              "European Innovation Academy is a 3-week accelerator that hosts 500 entrepreneurs, 100 mentors, and 50 professors from 40countries. They work with Stanford, UC Berkeley, Amadeus, Rovio Entertainment, Samsung, Microsoft, Google, the EuropeanUnion, and more."
            ],
            "list":[
              "Assisted COO in day-to-day operations during the summer school for start-ups, in Nice, France."
            ]
          }
        ]
      },
      "contact":{
        "header":"Contact"
       }
}